# Rebar Container Item Set From Curves Method

Source: https://www.revitapidocs.com/2026/9105e1da-4450-2919-fb63-6a043b3fb93d.htm

---

| Rebar Container Item Set From Curves Method |
| --- |

Overload List

|  | Name | Description |
| --- | --- | --- |
|  | SetFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IList Curve , RebarHookOrientation, RebarHookOrientation, Boolean, Boolean) | **Obsolete.** |
|  | SetFromCurves(RebarStyle, RebarBarType, RebarHookType, RebarHookType, XYZ, IList Curve , RebarTerminationOrientation, RebarTerminationOrientation, Boolean, Boolean) |  |

Top See Also

#### Reference

RebarContainerItem Class Autodesk.Revit.DB.Structure Namespace